/*
 * @Author: pwjworks
 * @Date: 2020-02-12 01:54:03
 * @Last Modified by: pwjworks
 * @Last Modified time: 2020-02-12 22:50:33
 */
// TODO 城市列表
const mp = new Map([
  ['河北省', ['石家庄', '唐山', '邯郸', '秦皇岛', '保定', '张家口', '承德', '廊坊', '沧州', '衡水', '邢台']],
  ['山西省', ['太原', '大同', '忻州', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '临汾', '吕梁']],
  ['辽宁省', ['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛']],
  ['吉林省', ['长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城']],
  ['黑龙江省', ['哈尔滨', '大庆', '齐齐哈尔', '佳木斯', '鸡西', '鹤岗', '双鸭山', '牡丹江', '伊春', '七台河', '黑河', '绥化']],
  ['江苏省', ['南京', '镇江', '常州', '无锡', '苏州', '徐州', '连云港', '淮安', '盐城', '扬州', '泰州', '南通', '宿迁']],
  ['浙江省', ['杭州', '嘉兴', '湖州', '宁波', '金华', '温州', '丽水', '绍兴', '衢州', '舟山', '台州']],
  ['安徽省', ['合肥', '蚌埠', '芜湖', '淮南', '亳州', '阜阳', '淮北', '宿州', '滁州', '安庆', '巢湖', '马鞍山', '宣城', '黄山', '池州', '铜陵']],
  ['福建省', ['福州', '厦门', '泉州', '三明', '南平', '漳州', '莆田', '宁德', '龙岩']],
  ['江西省', ['南昌', '九江', '赣州', '吉安', '鹰潭', '上饶', '萍乡', '景德镇', '新余', '宜春', '抚州']],
  ['山东省', ['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '菏泽', '滨州']],
  ['台湾省', ['台北', '台中', '基隆', '高雄', '台南', '新竹', '嘉义']],
  ['河南省', ['郑州', '洛阳', '开封', '漯河', '安阳', '新乡', '周口', '三门峡', '焦作', '平顶山', '信阳', '南阳', '鹤壁', '濮阳', '许昌', '商丘', '驻马店']],
  ['湖北省', ['武汉', '襄樊', '宜昌', '黄石', '鄂州', '随州', '荆州', '荆门', '十堰', '孝感', '黄冈', '咸宁']],
  ['湖南省', ['长沙', '株洲', '湘潭', '衡阳', '岳阳', '郴州', '永州', '邵阳', '怀化', '常德', '益阳', '张家界', '娄底']],
  ['广东省', ['广州', '深圳', '汕头', '惠州', '珠海', '揭阳', '佛山', '河源', '阳江', '茂名', '湛江', '梅州', '肇庆', '韶关', '潮州', '东莞', '中山', '清远', '江门', '汕尾', '云浮']],
  ['海南省', ['海口', '三亚']],
  ['四川省', ['成都', '绵阳', '德阳', '广元', '自贡', '攀枝花', '乐山', '南充', '内江', '遂宁', '广安', '泸州', '达州', '眉山', '宜宾', '雅安', '资阳']],
  ['贵州省', ['贵阳', '六盘水', '遵义', '安顺']],
  ['云南省', ['昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧']],
  ['陕西省', ['西安', '咸阳', '铜川', '延安', '宝鸡', '渭南', '汉中', '安康', '商洛', '榆林']],
  ['甘肃省', ['兰州', '天水', '平凉', '酒泉', '嘉峪关', '金昌', '白银', '武威', '张掖', '庆阳', '定西', '陇南']],
  ['青海省', ['西宁']],
  ['香港', ['香港']],
  ['澳门', ['澳门']]
])

export default mp
